Modulo basico - Analise exploratoria de Dados com Python

In [41]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [42]:
# importando a base inicial
df = pd.read_csv('../../data/train.csv')

In [43]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,712833.00,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7925.00,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,300.00,NaN,S

Entendendo os tipos de variaves que temos na base

In [44]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [45]:
# criando duas listas com nomes das colunas, uma para colinas qualitativas e outra para quantitativas

quali = []
quanti = []

for i in df.dtypes.index:
    if df.dtypes[i] == 'object': # type: ignore
        quali.append(i)
    else:
        quanti.append(i)

In [46]:
print('Lista Quanti: ', quanti)
print('Lista Quali: ', quali)

Lista Quanti:  ['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']
Lista Quali:  ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [47]:
# criando um dataframe para as variaveis quanti para fazer estatistica descritiva

df_quanti = df[quanti]

In [48]:
df_quanti

     PassengerId  Survived  Pclass   Age  SibSp  Parch       Fare
0              1         0       3  22.0      1      0       7.25
1              2         1       1  38.0      1      0  712833.00
2              3         1       3  26.0      0      0    7925.00
3              4         1       1  35.0      1      0      53.10
4              5         0       3  35.0      0      0     300.00
..           ...       ...     ...   ...    ...    ...        ...
886          887         0       2  27.0      0      0      13.00
887          888         1       1  19.0      0      0      30.00
888          889         0       3   NaN      1      2      23.45
889          890         1       1  26.0      0      0      30.00
890          891         0       3  32.0      0      0       7.75

[891 rows x 7 columns]

In [49]:
# estatistica descritiva
df_quanti.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,8.910000e+02
mean,446.000000,0.383838,2.308642,29.717325,0.523008,0.381594,7.424598e+05
std,257.353842,0.486592,0.836071,14.591695,1.102743,0.806057,5.995953e+06
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000e+00
25%,223.500000,0.000000,2.000000,20.000000,0.000000,0.000000,2.655000e+01
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,7.333000e+03
75%,668.500000,1.000000,3.000000,38.750000,1.000000,0.000000,2.546670e+05
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,1.240913e+08

In [50]:
# calculando mediana que nao esta no comando anterior
df_quanti.median()

PassengerId     446.0
Survived          0.0
Pclass            3.0
Age              28.0
SibSp             0.0
Parch             0.0
Fare           7333.0
dtype: float64

In [51]:
# Tabela de frequencia para as variaveis qualitativas

df_quali = df[quali]

# fazendo a tabela de frequencia para a variavel Sex

df_quali.groupby('Sex').Name.count()

Sex
female    314
male      577
Name: Name, dtype: int64

In [52]:
# fazendo todas as tttabelas de frequencia de uma evz so
# vamos desconsiderar a variavel Name que sera unica para cad passageiro

for i in df_quali.columns:
    if i == 'Name':
        pass
    else:
        print('---------------')
        print('Variavel: ', i)
        print(df_quali.groupby(i).Name.count())
        print('---------------')

---------------
Variavel:  Sex
Sex
female    314
male      577
Name: Name, dtype: int64
---------------
---------------
Variavel:  Ticket
Ticket
110152         3
110413         3
110465         2
110564         1
110813         1
              ..
W./C. 6608     4
W./C. 6609     1
W.E.P. 5734    1
W/C 14208      1
WE/P 5735      2
Name: Name, Length: 681, dtype: int64
---------------
---------------
Variavel:  Cabin
Cabin
A10    1
A14    1
A16    1
A19    1
A20    1
      ..
F33    3
F38    1
F4     2
G6     4
T      1
Name: Name, Length: 147, dtype: int64
---------------
---------------
Variavel:  Embarked
Embarked
C    168
Q     77
S    644
Name: Name, dtype: int64
---------------

Deteccao de dados nulos

In [53]:
# para cada variavel no df, iremos pegar a quantidade de dados nulos
# visualizar quantos nulos temos em cada variavel
# criar uma tabela para visualizar isso (um data frame)

nulos = pd.DataFrame()
nulos['Variavel'] =  df.columns

In [54]:
nulos

       Variavel
0   PassengerId
1      Survived
2        Pclass
3          Name
4           Sex
5           Age
6         SibSp
7         Parch
8        Ticket
9          Fare
10        Cabin
11     Embarked

In [55]:
nulos = (
    df.isna().sum()
      .reset_index()
      .rename(columns={"index": "Variavel", 0: "Quantidade"})
)
nulos["Porcentagem"] = ((nulos["Quantidade"] / df["PassengerId"].count()) * 100).round(2)

In [56]:
nulos

       Variavel  Quantidade  Porcentagem
0   PassengerId           0         0.00
1      Survived           0         0.00
2        Pclass           0         0.00
3          Name           0         0.00
4           Sex           0         0.00
5           Age         177        19.87
6         SibSp           0         0.00
7         Parch           0         0.00
8        Ticket           0         0.00
9          Fare           0         0.00
10        Cabin         687        77.10
11     Embarked           2         0.22

In [57]:
# removendo as linhas da variavel embarked

df2 = df.dropna(subset=['Embarked'])

In [58]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,712833.00,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7925.00,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,300.00,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [59]:
# preenchendo a variavel Age

df3 = df2.copy()
df3.Age = df2.Age.fillna(df2.Age.mean())

In [60]:
df3.Age.isna().sum()

np.int64(0)

In [61]:
# preenchendo a variavel Cabin

df4 = df3.copy()
print(df4.Cabin.mode())

0        B96 B98
1    C23 C25 C27
2             G6
Name: Cabin, dtype: object

In [62]:
# escolher um valor dentro da moda e preencher aleatoriamente

moda = []

for i in df4.Cabin.mode().values:
    moda.append(i)

In [63]:
moda

['B96 B98', 'C23 C25 C27', 'G6']

In [64]:
# preenchendo com valores aleatorios da moda
import random

df4.Cabin = df4.Cabin.fillna(random.choice(moda))

In [65]:
df4.Cabin.isna().sum()

np.int64(0)

In [66]:
df4

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.25,B96 B98,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,712833.00,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7925.00,B96 B98,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,300.00,B96 B98,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.00,B96 B98,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.660351,1,2,W./C. 6607,23.45,B96 B98,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.75,B96 B98,Q

Deteccao de Outliers

In [69]:
fig, axs = plt.subplots(2, 3, figsize=(20, 10))

axs[0, 0].set_title('Survived')
axs[0, 0].boxplot(df4.Survived)

axs[0, 1].set_title('Pclass')
axs[0, 1].boxplot(df4.Pclass)

axs[0, 2].set_title('Age')
axs[0, 2].boxplot(df4.Age)

axs[1, 0].set_title('SibSp')
axs[1, 0].boxplot(df4.SibSp)

axs[1, 1].set_title('Parch')
axs[1, 1].boxplot(df4.Parch)

axs[1, 2].set_title('Fare')
axs[1, 2].boxplot(df4.Fare)

{'whiskers': [<matplotlib.lines.Line2D at 0x1442b9c8050>,
  <matplotlib.lines.Line2D at 0x1442b9c8190>],
 'caps': [<matplotlib.lines.Line2D at 0x1442b9c82d0>,
  <matplotlib.lines.Line2D at 0x1442b9c8410>],
 'boxes': [<matplotlib.lines.Line2D at 0x1442b95bed0>],
 'medians': [<matplotlib.lines.Line2D at 0x1442b9c8550>],
 'fliers': [<matplotlib.lines.Line2D at 0x1442b9c8690>],
 'means': []}

In [70]:
# Cálculo dos Outliers

# Todos os pontos que estão fora do limite superior e inferior da amostra
# Limite superior = Q3 + 1,5 * DistânciaInterquartil
# Limite inferior = Q1 - 1,5 * DistânciaInterquartil
# Distância Interquartil = Valor do 3º Quartil - Valor do 1º Quartil (Q3 - Q1)

# Fazendo este cálculo para estas o Dataframe todo (apenas o quantitativo)

df4_quanti = df4[quanti]
colunas = df4_quanti.columns
outliers = []

for i in df4_quanti.columns:
    q1 = np.quantile(df4_quanti[i], 0.25)
    q3 = np.quantile(df4_quanti[i], 0.75)
    dist = q3 - q1
    lim_inf = q1 - 1.5*dist
    lim_sup = q3 + 1.5*dist
    
    print('----------------')
    print(dist)
    print(lim_inf)
    print(lim_sup)
    
    outlier = 0
    
    for j in df4_quanti.index:
        if df4_quanti[i][j] < lim_inf:
            outlier = outlier + 1
        elif df4_quanti[i][j] > lim_sup:
            outlier = outlier + 1
        else:
            pass
    
    outliers.append(outlier)

df_outlier = pd.DataFrame()
df_outlier['variavel'] = colunas
df_outlier['outliers'] = outliers
df_outlier['Porcentagem'] = (outliers/df4_quanti.PassengerId.count()) * 100

----------------
444.0
-442.0
1334.0
----------------
1.0
-1.5
2.5
----------------
1.0
0.5
4.5
----------------
13.0
2.5
54.5
----------------
1.0
-1.5
2.5
----------------
0.0
0.0
0.0
----------------
254640.45
-381934.12500000006
636627.675

In [71]:
df_outlier

      variavel  outliers  Porcentagem
0  PassengerId         0     0.000000
1     Survived         0     0.000000
2       Pclass         0     0.000000
3          Age        66     7.424072
4        SibSp        46     5.174353
5        Parch       213    23.959505
6         Fare       153    17.210349

Visualizacao de Dados

In [74]:
# quantas pessoas morreram e quantas sobreviveram

sns.countplot(x='Survived', data=df4);

In [75]:
# quantas pessoas morreram e sobreviveram, separados por sexo

df4.groupby(['Survived', 'Sex'])['Survived'].count()

Survived  Sex
0         female     81
          male      468
1         female    231
          male      109
Name: Survived, dtype: int64

In [79]:
sns.catplot(x='Sex', col='Survived', kind='count', data=df4)

In [80]:
sns.catplot(x='Pclass', col='Survived', kind='count', data=df4)

In [83]:
sns.catplot(x='Survived', col='Embarked', kind='count', data=df4)

In [89]:
sns.barplot(x='Survived', y='Age', data=df4)

In [90]:
plt.figure(figsize=(20,10))
sns.heatmap(df4.corr(), annot=True, linewidths=1.5, fmt='.2f')

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'